brew "nvim"
brew "tmux"

# Tooling
brew "luarocks"
brew "lazygit"
brew "jq"
brew "yq"
brew "direnv"
brew "nushell"
brew "go-task"
brew "terragrunt"
brew "bat"
brew "gh"

# Kubernetes
brew "k9s"
brew "kubectl"
brew "talosctl"
brew "helm"
brew "cilium-cli"

###########################
#  Programming languages  #
###########################

# GO
brew "golang"
brew "gopls"
tap "silenceper/tap"
brew "gowatch"
brew "delve"
brew "golangci-lint"

# JavaScript/TypeScript
brew "nvm"
brew "nodejs"
brew "pnpm"
brew "typescript"
brew "typescript-language-server"

# python
brew "python3"

# Lua
brew "lua-language-server"

# rust
brew "rustup"
brew "rust"
